NextFOAM-2602/tutorials/incompressible/pimpleFoam/RAS/TJunctionFan/0.orig/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [m^2 s^-2];

internalField   uniform 0.375;

boundaryField
{
    inlet
    {
        type            turbulentIntensityKineticEnergyInlet;
        intensity       0.05;
        value           uniform 0.375;
    }

    outlet1
    {
        type            inletOutlet;
        inletValue      uniform 0.375;
        value           uniform 0.375;
    }

    outlet2
    {
        type            inletOutlet;
        inletValue      uniform 0.375;
        value           uniform 0.375;
    }

    defaultFaces
    {
        type            kqRWallFunction;
        value           uniform 0.375;
    }
}


// ************************************************************************* //
